package uz.abdukarimov.executer;

public class Main {

    //     ┌──────────────────────┬──────────┬───────────┬────────────────────┐
    //     │ Pool turi            │ Core     │ Max       │ Queue              │
    //     ├──────────────────────┼──────────┼───────────┼────────────────────┤
    //     │ FixedThreadPool(n)   │ n        │ n         │ LinkedBlockingQueue│
    //     │ CachedThreadPool     │ 0        │ MAX_INT   │ SynchronousQueue   │
    //     │ SingleThreadExecutor │ 1        │ 1         │ LinkedBlockingQueue│
    //     │ ScheduledThreadPool  │ n        │ MAX_INT   │ DelayedWorkQueue   │
    //     ├──────────────────────┼──────────┼───────────┼────────────────────┤
    //     │ Qachon ishlatish     │          │           │                    │
    //     │ Fixed    → CPU bound task (ma'lum miqdor parallel)               │
    //     │ Cached   → Ko'p qisqa muddatli I/O task                          │
    //     │ Single   → Tartib muhim, ketma-ket bajarish                      │
    //     │ Scheduled→ Cron-like, vaqt asosida ishga tushirish               │
    //     └───────────────────────────────────────────────────────────────-──┘

}
